! ===========================================================================
!
!   CyrDef.h:
!   Определение Z-таблицы для кириллицы.
!   (Этот файл должен быть ПЕРВЫМ, включенным в любую программу,
!   использующую русский язык!)
!
!   Source encoding: UTF-8
!
!   (c) Serge Vakulenko 2023
!
! ---------------------------------------------------------------------------

Zcharacter table   '@{410}' '@{411}' '@{412}' '@{413}' '@{414}' '@{415}' '@{416}' '@{417}';
Zcharacter table + '@{418}' '@{419}' '@{41a}' '@{41b}' '@{41c}' '@{41d}' '@{41e}' '@{41f}';
Zcharacter table + '@{420}' '@{421}' '@{422}' '@{423}' '@{424}' '@{425}' '@{426}' '@{427}';
Zcharacter table + '@{428}' '@{429}' '@{42a}' '@{42b}' '@{42c}' '@{42d}' '@{42e}' '@{42f}';
Zcharacter table + '@{430}' '@{431}' '@{432}' '@{433}' '@{434}' '@{435}' '@{436}' '@{437}';
Zcharacter table + '@{438}' '@{439}' '@{43a}' '@{43b}' '@{43c}' '@{43d}' '@{43e}' '@{43f}';
Zcharacter table + '@{440}' '@{441}' '@{442}' '@{443}' '@{444}' '@{445}' '@{446}' '@{447}';
Zcharacter table + '@{448}' '@{449}' '@{44a}' '@{44b}' '@{44c}' '@{44d}' '@{44e}' '@{44f}';
Zcharacter table + '@{401}' '@{451}';

Zcharacter
  "абвгдежзийклмнопрстуфхьэюя"
  "АБВГДЕЖЗИЙКЛМНОПРСТУФХЬЭЮЯ"
  "ёЁцЦчЧшШщЩыЫъЪ():;,.!?/";

Zcharacter table + '@<<' '@>>';
